Show / Hide Table of Contents
Enum AnchorType
Defines a type of anchor end.
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum AnchorType
Fields
 Name |  Description
 Straight
Straight end - no washer.
 WasherPlateCircular
Circular washer plate.
 WasherPlateRectangular
Rectangular washer plate.
 Improve this Doc
 View Source